#урок пятый , домашнее задание №1

# list1 = [4, 5, 2, 4, 3, 5, 2, 1]
#не понял чего тут надо писать

#урок пятый , домашнее задание №2(тут тоже не понял)

#урок пятый , домашнее задание №3


# list1 = [2, 5, 7, 1, 4, 5, 10]
# if list1 = >=5:
#     print('больше')
# if list1 = <=5:
#     print('меньше')
    #не понял почему ошибку выдают

#урок пятый , домашнее задание №4

#first_name = int(input('Введите имя: '))
#last_name = int(input('Введите фамилия: '))
#age = int(input('Введите свой возраст: '))
#я это задание понимаю что от меня хотят но не знаю как это делать
#урок пятый , домашнее задание №5

# number = int(input('Введите свой пример'))
# answer = (int(x) for x in number.split("+"))
# print('answer')
#я понял как делать но не знаю почему ошибку выдают


#урок пятый , домашнее задание №6(не понял ничего)

